src/cfe/archic41c_БСП.ТочкиИнтеграции/src/Catalogs/ИнформационныеСистемы/ИнформационныеСистемы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеСистемы</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>DefinedType.Пользователь</types>
    </type>
  </attributes>
  <attributes>
    <name>АрхитектураРаботы</name>
    <type>
      <types>EnumRef.АрхитектурыРаботыИС</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ресурсы</name>
    <attributes>
      <name>РесурсИнформационнойСистемы</name>
      <type>
        <types>CatalogRef.РесурсыИнформационныхСистем</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cfe/archic41c_БСП.ТочкиИнтеграции/src/Enums/АрхитектурыРаботыИС/АрхитектурыРаботыИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>АрхитектурыРаботыИС</name>
  <enumValues>
    <name>Приложение</name>
  </enumValues>
  <enumValues>
    <name>ВебСервер</name>
  </enumValues>
  <enumValues>
    <name>ФайловыйСервер</name>
  </enumValues>
  <enumValues>
    <name>СерверБазДанных</name>
  </enumValues>
  <enumValues>
    <name>КонсольноеПриложение</name>
  </enumValues>
  <enumValues>
    <name>МобильноеПриложение</name>
  </enumValues>
  <enumValues>
    <name>ВнешнийСервис</name>
  </enumValues>
  <enumValues>
    <name>ИнтеграционнаяШина</name>
  </enumValues>
  <enumValues>
    <name>БизнесДомен</name>
  </enumValues>
</mdclass:Enum>

src/cfe/archic41c_БСП.ТочкиИнтеграции/src/Catalogs/ИнформационныеСистемы/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СокращеннаяСтрокаАрхитектуры = "";
	Если АрхитектураРаботы = Перечисления.АрхитектурыРаботыИС.ВебСервер Тогда
	
		 СокращеннаяСтрокаАрхитектуры = "<Веб сервер>";
		
	ИначеЕсли АрхитектураРаботы = Перечисления.АрхитектурыРаботыИС.ФайловыйСервер Тогда
	
		 СокращеннаяСтрокаАрхитектуры = "<Файловый сервер>";
		
	ИначеЕсли АрхитектураРаботы = Перечисления.АрхитектурыРаботыИС.СерверБазДанных Тогда
	
		 СокращеннаяСтрокаАрхитектуры = "<СУБД>";
		
	ИначеЕсли АрхитектураРаботы = Перечисления.АрхитектурыРаботыИС.КонсольноеПриложение Тогда
	
		 СокращеннаяСтрокаАрхитектуры = "<Набор скриптов>";
		
	ИначеЕсли АрхитектураРаботы = Перечисления.АрхитектурыРаботыИС.ИнтеграционнаяШина Тогда
	
		 СокращеннаяСтрокаАрхитектуры = "<ESB>";
		
	ИначеЕсли АрхитектураРаботы = Перечисления.АрхитектурыРаботыИС.ВнешнийСервис Тогда
	
		 СокращеннаяСтрокаАрхитектуры = "<Внешняя>";
		
	Иначе 
		// Приложение и прочие
		СокращеннаяСтрокаАрхитектуры = "";
	
	КонецЕсли;
	
	Наименование = СтрШаблон(НСтр("ru = '%2%1'"), КраткоеНаименование, СокращеннаяСтрокаАрхитектуры);

	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();

КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
